const html_template = require('./html_template');

module.exports = {
    html_template,
    common: {
        header_subtitle: 'Реальное. Аппаратное. Свободное.',
    },
    index: {
        boomer1: 'Ты бумер, и не признаёшь стриминговые сервисы для прослушивания музыки онлайн?',
        boomer2: 'Хочешь не зависеть от Интернета при прослушивании радио?',
        boomer3: 'Есть устройство с процессором Qualcomm?',
        boomer4: 'Приложение RFM Radio для тебя!',
        download: 'Скачать',
        feat_title: 'Возможности',
        feat1: 'Прослушивание радиостанций',
        feat2: 'Отображение RDS: поддерживаются PS, RT, PTY и AF',
        feat3: 'Отображение качества сигнала в dB',
        feat4: 'Возможность записи эфира в файл (WAV или MP3)',
        open_source_title: 'RFM Radio - свобдный проект',
        open_source_description: 'Приложение является опенсорсным и каждый может посмотреть исходный код в репозитории на GitHub.',
        open_source_repo: 'Репозиторий на GitHub',
        support_list_title: 'Поддержка устройствами',
        support_list_description: 'Работоспособность приложения зависит от огромного количества факторов: от процессора, прошивки, версии Android, версии ядра и т. д. Пробуйте установить.',
        contributors_title: 'Авторы',
        contributors_description: 'Благодаря этим людям есть RFM',
        contributors_vv: 'Владислав Велюга &mdash; разработчик приложения RFM Radio',
        contributors_md: 'Mike Reid &mdash; разработчик приложений Spirit1 и Spirit2 (несколько фрагментов кода Spirit2 используется в RFM)',
        contributors_km: 'Константин Манаев &mdash; английская локализация',
    },
    donate: {
        title: 'Пожертвование',
        head: 'Пожертвование',
        p1: 'RFM Radio – полностью бесплатное приложение. В нем нет рекламы, нет premium-опций. Но у вас есть уникальная возможность помочь его разработке – внести добровольное пожертвование!',
        p2: 'Достаточно небольшого пожертвования, чтобы принести очень существенную пользу приложению – 135 рублей.',
        p3: 'Несколько способов сделать пожертвование:',
        yandex_money: 'Yandex.Money',
        // Пожертвование на разработку RFM Radio
        ym_target_encoded: '%D0%9F%D0%BE%D0%B6%D0%B5%D1%80%D1%82%D0%B2%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5%20%D0%BD%D0%B0%20%D1%80%D0%B0%D0%B7%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D1%83%20RFM%20Radio',
    },
    donate_ok: {
        thanks: 'Спасибо за пожветвование!',
    },
};
